posts/2024-11-10-database-of-flowing-knowledge.org
#+title: 数据库的搭建 - 流动知识检索
#+date: <2024-11-10 18:36>
#+description:
#+filetags: PKM Github Python Database

Readwise 是我体验的最舒服的 after-reading 软件了，之前一直没有利用好它的 API，在 PKM 体系里，也一直没有统一到工作流。而这些流动知识的数据越来越多，以 10 年 20 年来度量，必须用数据库来完善和管理了，也是碰巧看到了这个项目：[[https://github.com/pocketbase/pocketbase][pocketbase/pocketbase: Open Source realtime backend in 1 file]] ,很简洁的管理 UI，支持 S3 数据备份，支持 API 导入和导出。

在 Claude 的协助下，有了现在的方案。

主要思路：利用 GitHub 为中转站， ~osmos::memos~ 插件保存文章，同步保存到 Readwise 进行阅读和高亮，再同步保存到 pocketbase 做数据库处理。

* 同步保存到 Readwise

现在使用 ~osmos::memos~ 插件保存的时候，会默认也保存到 readwise。添加 ~#2clip~ 标签触发 clip 的 workflow。详见： [[https://www.vandee.art/2024-10-12-bookmark-and-summary-by-github-actions.html][用 GitHub 仓库做书签和 AI 摘要 - 流动知识检索]]

这样就统一起来了。所有的链接都保存在 bookmark-collection 仓库作为中转站，然后统一在 Readwise 里阅读，导出 highlights。有保存价值的会触发 clip workflow 保存原文。

主要思路：在 push 的时候会运行这个 Python 脚本，读取新增内容，获取 URL 并使用 Readwise Reader 的 API 保存到 Readwise Reader。Readwise 和 Readwise Reader 是两个 API。

需要在仓库的 secret 里增加一个 ~READWISE_TOKEN~ secert，填入自己的 Readwise API。
