2024-11-10-database-of-flowing-knowledge.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.vandee.art/rss.xml"
      title="RSS feed for https://www.vandee.art/">
<title>数据库的搭建 - 流动知识检索</title>
<meta property="og:title" content="数据库的搭建 - 流动知识检索">
<meta property="og:type" content="article" />
<meta property="og:url" content="https://www.vandee.art/2024-11-10-database-of-flowing-knowledge.html">
<meta name="author" content="Vandee">
       <meta name="referrer" content="no-referrer">
       <meta name="viewport" content="width=device-width, initial-scale=1.0">

       <link rel="stylesheet" href="assets/css/style.css" type="text/css"/>
       <link rel="stylesheet"
             href="https://lf26-cdn-tos.bytecdntp.com/cdn/expire-1-M/font-awesome/6.0.0/css/all.min.css"/>
       <link rel="stylesheet"
             href="https://testingcf.jsdelivr.net/npm/@fancyapps/ui@4.0.12/dist/fancybox.css"/>
       <link rel="icon" type="image/x-icon" href="/static/favicon.ico"/>


</head>
<body>
<div id="preamble" class="status">
      <header>
      <h1><a href="https://www.vandee.art/">Vandee's Blog</a></h1>
      <nav>
      <a href="https://www.vandee.art/">Home</a>
      <a href="https://wiki.vandee.art">Wiki</a>
      <a href="archive.html">Archive</a>
      <a href="tags.html">Tags</a>
      <div id="search-container">
        <input type="text" id="search-input" placeholder="Search anywhere...">
        <i class="fas fa-search search-icon"></i>
      </div>
      </nav>
      </header></div>
<div id="content">
<div class="post-date">10 Nov 2024</div><h1 class="post-title"><a href="https://www.vandee.art/2024-11-10-database-of-flowing-knowledge.html">数据库的搭建 - 流动知识检索</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org490d3a4">同步保存到 Readwise</a>
<ul>
<li><a href="#org9fa2b7b">python</a></li>
<li><a href="#org9646b73">workflow</a></li>
</ul>
</li>
<li><a href="#orgdc67e56">PocketBase</a>
<ul>
<li><a href="#org7b543bb">docker 部署到 VPS</a></li>
<li><a href="#org06a5f32">Python</a></li>
<li><a href="#orgf8b0d73">workflow</a></li>
</ul>
</li>
<li><a href="#org8362f78">Readwise highlights</a>
<ul>
<li><a href="#org28e6db7">python</a></li>
<li><a href="#orgb8822e5">workflow</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Readwise 是我体验的最舒服的 after-reading 软件了，之前一直没有利用好它的 API，在 PKM 体系里，也一直没有统一到工作流。而这些流动知识的数据越来越多，以 10 年 20 年来度量，必须用数据库来完善和管理了，也是碰巧看到了这个项目：<a href="https://github.com/pocketbase/pocketbase">pocketbase/pocketbase: Open Source realtime backend in 1 file</a> ,很简洁的管理 UI，支持 S3 数据备份，支持 API 导入和导出。
</p>

<p>
在 Claude 的协助下，有了现在的方案。
</p>

<p>
主要思路：利用 GitHub 为中转站， <code>osmos::memos</code> 插件保存文章，同步保存到 Readwise 进行阅读和高亮，再同步保存到 pocketbase 做数据库处理。
</p>
<div id="outline-container-org490d3a4" class="outline-2">
<h2 id="org490d3a4">同步保存到 Readwise</h2>
<div class="outline-text-2" id="text-org490d3a4">
<p>
现在使用 <code>osmos::memos</code> 插件保存的时候，会默认也保存到 readwise。添加 <code>#2clip</code> 标签触发 clip 的 workflow。详见： <a href="https://www.vandee.art/2024-10-12-bookmark-and-summary-by-github-actions.html">用 GitHub 仓库做书签和 AI 摘要 - 流动知识检索</a>
</p>

<p>
这样就统一起来了。所有的链接都保存在 bookmark-collection 仓库作为中转站，然后统一在 Readwise 里阅读，导出 highlights。有保存价值的会触发 clip workflow 保存原文。
</p>

<p>
主要思路：在 push 的时候会运行这个 Python 脚本，读取新增内容，获取 URL 并使用 Readwise Reader 的 API 保存到 Readwise Reader。Readwise 和 Readwise Reader 是两个 API。
</p>

<p>
需要在仓库的 secret 里增加一个 <code>READWISE_TOKEN</code> secert，填入自己的 Readwise API。
</p>
</div>
