2024-11-10-database-of-flowing-knowledge.html
<div id="outline-container-org06a5f32" class="outline-3">
<h3 id="org06a5f32">Python</h3>
<div class="outline-text-3" id="text-org06a5f32">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #51afef;">import</span> os
<span style="color: #51afef;">import</span> re
<span style="color: #51afef;">import</span> logging
<span style="color: #51afef;">import</span> requests
<span style="color: #51afef;">from</span> github <span style="color: #51afef;">import</span> Github

logging.basicConfig(
    level=logging.INFO,
    <span style="color: #c678dd;">format</span>=<span style="color: #98be65;">'%(asctime)s - %(message)s'</span>,
    datefmt=<span style="color: #98be65;">'%Y-%m-%d %H:%M:%S'</span>
)

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">get_added_content</span>():
    <span style="color: #83898d;">"""&#33719;&#21462;&#36825;&#27425;&#25552;&#20132;&#26032;&#22686;&#30340;&#20869;&#23481;"""</span>
    <span style="color: #51afef;">try</span>:
        <span style="color: #dcaeea;">g</span> = Github(os.environ[<span style="color: #98be65;">'GITHUB_TOKEN'</span>])
        <span style="color: #dcaeea;">repo</span> = g.get_repo(os.environ[<span style="color: #98be65;">'GITHUB_REPOSITORY'</span>])
        <span style="color: #dcaeea;">commit_sha</span> = os.environ.get(<span style="color: #98be65;">'GITHUB_SHA'</span>)
        <span style="color: #dcaeea;">commit</span> = repo.get_commit(commit_sha)
        <span style="color: #51afef;">for</span> <span style="color: #c678dd;">file</span> <span style="color: #51afef;">in</span> commit.files:
            <span style="color: #51afef;">if</span> <span style="color: #c678dd;">file</span>.filename.endswith(<span style="color: #98be65;">'.md'</span>):
                <span style="color: #51afef;">if</span> <span style="color: #c678dd;">file</span>.patch <span style="color: #51afef;">and</span> <span style="color: #98be65;">'+'</span> <span style="color: #51afef;">in</span> <span style="color: #c678dd;">file</span>.patch:
                    <span style="color: #dcaeea;">added_lines</span> = [line[<span style="color: #da8548; font-weight: bold;">1</span>:] <span style="color: #51afef;">for</span> line <span style="color: #51afef;">in</span> <span style="color: #c678dd;">file</span>.patch.split(<span style="color: #98be65;">'</span><span style="color: #a9a1e1;">\n</span><span style="color: #98be65;">'</span>)
                                 <span style="color: #51afef;">if</span> line.startswith(<span style="color: #98be65;">'+'</span>) <span style="color: #51afef;">and</span> <span style="color: #51afef;">not</span> line.startswith(<span style="color: #98be65;">'+++'</span>)]
                    <span style="color: #51afef;">return</span> added_lines
        <span style="color: #51afef;">return</span> []
    <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
        logging.error(f<span style="color: #98be65;">"Error getting commit content: </span>{<span style="color: #c678dd;">str</span>(e)}<span style="color: #98be65;">"</span>)
        <span style="color: #51afef;">raise</span>

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">extract_url_and_title</span>(line: <span style="color: #c678dd;">str</span>):
    <span style="color: #83898d;">"""&#20174;&#34892;&#20013;&#25552;&#21462;URL&#21644;&#26631;&#39064;&#65292;&#25903;&#25345;markdown&#26684;&#24335;&#30340;&#38142;&#25509; [title](url)"""</span>
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#26356;&#26032;&#21518;&#30340;&#25552;&#21462;&#27169;&#24335;&#65292;&#21516;&#26102;&#33719;&#21462;&#26631;&#39064;&#21644;URL</span>
    <span style="color: #dcaeea;">pattern</span> = r<span style="color: #98be65;">'\[(.*?)\]\((https?://[\w\-._~:/?#\[\]@!$&amp;\'()*+,;=.%]+)\)'</span>
    <span style="color: #51afef;">match</span> = re.search(pattern, line)
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">match</span>:
        <span style="color: #dcaeea;">title</span> = <span style="color: #51afef;">match</span>.group(<span style="color: #da8548; font-weight: bold;">1</span>)
        <span style="color: #dcaeea;">url</span> = <span style="color: #51afef;">match</span>.group(<span style="color: #da8548; font-weight: bold;">2</span>)
        <span style="color: #51afef;">return</span> url, title
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">None</span>, <span style="color: #a9a1e1;">None</span>

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">has_clip_tag</span>(line: <span style="color: #c678dd;">str</span>) -&gt; <span style="color: #c678dd;">bool</span>:
    <span style="color: #83898d;">"""&#26816;&#26597;&#26159;&#21542;&#21253;&#21547; #2clip &#26631;&#31614;"""</span>
    <span style="color: #51afef;">return</span> <span style="color: #c678dd;">bool</span>(re.search(r<span style="color: #98be65;">'#2clip\b'</span>, line))

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">trigger_workflow</span>():
    <span style="color: #83898d;">"""&#35302;&#21457;&#21478;&#19968;&#20010;workflow"""</span>
    <span style="color: #51afef;">try</span>:
        <span style="color: #dcaeea;">g</span> = Github(os.environ[<span style="color: #98be65;">'GITHUB_TOKEN'</span>])
        <span style="color: #dcaeea;">repo</span> = g.get_repo(os.environ[<span style="color: #98be65;">'GITHUB_REPOSITORY'</span>])
        <span style="color: #dcaeea;">workflow</span> = repo.get_workflow(<span style="color: #98be65;">"bookmark_summary.yml"</span>)
        workflow.create_dispatch(<span style="color: #98be65;">"main"</span>)
        logging.info(<span style="color: #98be65;">"Successfully triggered the bookmark_summary workflow"</span>)
    <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
        logging.error(f<span style="color: #98be65;">"Failed to trigger workflow: </span>{<span style="color: #c678dd;">str</span>(e)}<span style="color: #98be65;">"</span>)
        <span style="color: #51afef;">raise</span>

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">main</span>():
    <span style="color: #51afef;">try</span>:
        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#33719;&#21462;&#25152;&#26377;&#26032;&#22686;&#30340;&#20869;&#23481;</span>
        <span style="color: #dcaeea;">added_lines</span> = get_added_content()
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">not</span> added_lines:
            logging.info(<span style="color: #98be65;">"No new markdown content found in this commit"</span>)
            <span style="color: #51afef;">return</span>

        <span style="color: #dcaeea;">trigger_needed</span> = <span style="color: #a9a1e1;">False</span>
        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#22788;&#29702;&#27599;&#19968;&#34892;&#26032;&#22686;&#30340;&#20869;&#23481;</span>
        <span style="color: #51afef;">for</span> line <span style="color: #51afef;">in</span> added_lines:
            <span style="color: #dcaeea;">line</span> = line.strip()
            logging.info(f<span style="color: #98be65;">"Processing line: </span>{line}<span style="color: #98be65;">"</span>)

            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#26816;&#26597;&#26631;&#31614;</span>
            <span style="color: #51afef;">if</span> has_clip_tag(line):
                <span style="color: #dcaeea;">trigger_needed</span> = <span style="color: #a9a1e1;">True</span>
                logging.info(<span style="color: #98be65;">"Found #2clip tag"</span>)

            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#25552;&#21462;&#24182;&#22788;&#29702;URL&#21644;&#26631;&#39064;&#65288;&#26080;&#35770;&#26159;&#21542;&#26377;&#26631;&#31614;&#65289;</span>
            <span style="color: #dcaeea;">url</span>, <span style="color: #dcaeea;">title</span> = extract_url_and_title(line)
            <span style="color: #51afef;">if</span> url:
                <span style="color: #51afef;">try</span>:
                    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#21457;&#36865;&#21040; Readwise</span>
                    <span style="color: #dcaeea;">response</span> = requests.post(
                        url=<span style="color: #98be65;">"https://readwise.io/api/v3/save/"</span>,
                        headers={<span style="color: #98be65;">"Authorization"</span>: f<span style="color: #98be65;">"Token </span>{os.environ['READWISE_TOKEN']}<span style="color: #98be65;">"</span>},
                        json={
                            <span style="color: #98be65;">"url"</span>: url,
                            <span style="color: #98be65;">"tags"</span>: [<span style="color: #98be65;">"Bookmark"</span>]
                        }
                    )
                    response.raise_for_status()
                    logging.info(f<span style="color: #98be65;">"Successfully saved URL to Readwise: </span>{url}<span style="color: #98be65;">"</span>)

                    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#21457;&#36865;&#21040;&#31532;&#20108;&#20010; API endpoint</span>
                    <span style="color: #dcaeea;">second_response</span> = requests.post(
                        url=os.environ[<span style="color: #98be65;">'POCKETBASE_API'</span>],
                        headers={
                            <span style="color: #98be65;">"x_token"</span>: f<span style="color: #98be65;">"</span>{os.environ['POCKETBASE_TOKEN']}<span style="color: #98be65;">"</span>,
                            <span style="color: #98be65;">"Content-Type"</span>: <span style="color: #98be65;">"application/json"</span>
                        },
                        json={
                            <span style="color: #98be65;">"URL"</span>: url,
                            <span style="color: #98be65;">"title"</span>: title
                        }
                    )
                    second_response.raise_for_status()
                    logging.info(f<span style="color: #98be65;">"Successfully saved URL to pocketbase: </span>{url}<span style="color: #98be65;">"</span>)

                <span style="color: #51afef;">except</span> requests.exceptions.RequestException <span style="color: #51afef;">as</span> e:
                    logging.error(f<span style="color: #98be65;">"Failed to save URL </span>{url}<span style="color: #98be65;">: </span>{<span style="color: #c678dd;">str</span>(e)}<span style="color: #98be65;">"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#22914;&#26524;&#21457;&#29616;&#20102;&#26631;&#31614;&#65292;&#35302;&#21457;workflow</span>
        <span style="color: #51afef;">if</span> trigger_needed:
            logging.info(<span style="color: #98be65;">"Triggering workflow due to #2clip tag"</span>)
            trigger_workflow()

    <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
        logging.error(f<span style="color: #98be65;">"Error: </span>{<span style="color: #c678dd;">str</span>(e)}<span style="color: #98be65;">"</span>)
        <span style="color: #51afef;">raise</span>

<span style="color: #51afef;">if</span> <span style="color: #c678dd;">__name__</span> == <span style="color: #98be65;">"__main__"</span>:
    main()

</pre>
</div>
</div>
</div>
