posts/2024-11-10-database-of-flowing-knowledge.org
** workflow

#+begin_src yaml
name: Save Bookmark to Readwise

on:
  push:
    branches:
      - main
    paths:
      - '**.md'
  workflow_dispatch:

permissions:
  contents: read
  actions: write

jobs:
  save-to-readwise:
    runs-on: ubuntu-latest

    steps:
    - name: Checkout repository
      uses: actions/checkout@v4
      with:
        token: ${{ secrets.GITHUB_TOKEN }}

    - name: Set up Python
      uses: actions/setup-python@v4
      with:
        python-version: '3.10'

    - name: Install dependencies
      run: |
        python -m pip install --upgrade pip
        pip install requests PyGithub

    - name: Run bookmark saver
      env:
        READWISE_TOKEN: ${{ secrets.READWISE_TOKEN }}
        GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
        GITHUB_REPOSITORY: ${{ github.repository }}
        POCKETBASE_API: ${{ secrets.POCKETBASE_API }}
        POCKETBASE_TOKEN: ${{ secrets.POCKETBASE_TOKEN }}
      run: python save_to_readwise.py

#+end_src

* Readwise highlights

写了一个 ~class ReadwiseAPI~ 方便其他项目引入。可以定时获取我所有 highlights 的 title 和 url。

后面可以直接把 highlights 导入到 pocketbase。
