2024-11-10-database-of-flowing-knowledge.html
<div id="outline-container-orgf8b0d73" class="outline-3">
<h3 id="orgf8b0d73">workflow</h3>
<div class="outline-text-3" id="text-orgf8b0d73">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">name</span>: Save Bookmark to Readwise

<span style="color: #a9a1e1;">on</span>:
  <span style="color: #dcaeea;">push</span>:
    <span style="color: #dcaeea;">branches</span>:
      - main
    <span style="color: #dcaeea;">paths</span>:
      - <span style="color: #98be65;">'**.md'</span>
  <span style="color: #dcaeea;">workflow_dispatch</span>:

<span style="color: #dcaeea;">permissions</span>:
  <span style="color: #dcaeea;">contents</span>: read
  <span style="color: #dcaeea;">actions</span>: write

<span style="color: #dcaeea;">jobs</span>:
  <span style="color: #dcaeea;">save-to-readwise</span>:
    <span style="color: #dcaeea;">runs-on</span>: ubuntu-latest

    <span style="color: #dcaeea;">steps</span>:
    - <span style="color: #dcaeea;">name</span>: Checkout repository
      <span style="color: #dcaeea;">uses</span>: actions/checkout@v4
      <span style="color: #dcaeea;">with</span>:
        <span style="color: #dcaeea;">token</span>: ${{ secrets.GITHUB_TOKEN }}

    - <span style="color: #dcaeea;">name</span>: Set up Python
      <span style="color: #dcaeea;">uses</span>: actions/setup-python@v4
      <span style="color: #dcaeea;">with</span>:
        <span style="color: #dcaeea;">python-version</span>: <span style="color: #98be65;">'3.10'</span>

    - <span style="color: #dcaeea;">name</span>: Install dependencies
      <span style="color: #dcaeea;">run</span>: |
        <span style="color: #98be65;">python -m pip install --upgrade pip</span>
<span style="color: #98be65;">        pip install requests PyGithub</span>

    - <span style="color: #dcaeea;">name</span>: Run bookmark saver
      <span style="color: #dcaeea;">env</span>:
        <span style="color: #dcaeea;">READWISE_TOKEN</span>: ${{ secrets.READWISE_TOKEN }}
        <span style="color: #dcaeea;">GITHUB_TOKEN</span>: ${{ secrets.GITHUB_TOKEN }}
        <span style="color: #dcaeea;">GITHUB_REPOSITORY</span>: ${{ github.repository }}
        <span style="color: #dcaeea;">POCKETBASE_API</span>: ${{ secrets.POCKETBASE_API }}
        <span style="color: #dcaeea;">POCKETBASE_TOKEN</span>: ${{ secrets.POCKETBASE_TOKEN }}
      <span style="color: #dcaeea;">run</span>: python save_to_readwise.py

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8362f78" class="outline-2">
<h2 id="org8362f78">Readwise highlights</h2>
<div class="outline-text-2" id="text-org8362f78">
<p>
写了一个 <code>class ReadwiseAPI</code> 方便其他项目引入。可以定时获取我所有 highlights 的 title 和 url。
</p>

<p>
后面可以直接把 highlights 导入到 pocketbase。
</p>
</div>
