2024-11-10-database-of-flowing-knowledge.html
<div id="outline-container-org28e6db7" class="outline-3">
<h3 id="org28e6db7">python</h3>
<div class="outline-text-3" id="text-org28e6db7">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #51afef;">import</span> requests
<span style="color: #51afef;">import</span> json
<span style="color: #51afef;">from</span> datetime <span style="color: #51afef;">import</span> datetime, timedelta
<span style="color: #51afef;">import</span> os
<span style="color: #51afef;">from</span> typing <span style="color: #51afef;">import</span> List, Dict, Optional
<span style="color: #51afef;">from</span> pathlib <span style="color: #51afef;">import</span> Path
<span style="color: #51afef;">import</span> re
<span style="color: #51afef;">from</span> github <span style="color: #51afef;">import</span> Github
<span style="color: #51afef;">import</span> argparse

<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">ReadwiseAPI</span>:
    <span style="color: #83898d;">"""Readwise API client for exporting highlights with smart update capability and GitHub integration"""</span>

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">__init__</span>(<span style="color: #51afef;">self</span>):
        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Initialize Readwise token</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">readwise_token</span> = os.environ.get(<span style="color: #98be65;">"READWISE_TOKEN"</span>)
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">not</span> <span style="color: #51afef;">self</span>.readwise_token:
            <span style="color: #51afef;">raise</span> <span style="color: #ECBE7B;">ValueError</span>(<span style="color: #98be65;">"READWISE_TOKEN not found in environment variables"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Initialize GitHub token</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">github_token</span> = os.environ.get(<span style="color: #98be65;">"GITHUB_TOKEN"</span>)
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">not</span> <span style="color: #51afef;">self</span>.github_token:
            <span style="color: #51afef;">raise</span> <span style="color: #ECBE7B;">ValueError</span>(<span style="color: #98be65;">"GITHUB_TOKEN not found in environment variables"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Get repository from GitHub Actions environment variable</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">github_repo</span> = os.environ.get(<span style="color: #98be65;">"GITHUB_REPOSITORY"</span>)
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">not</span> <span style="color: #51afef;">self</span>.github_repo:
            <span style="color: #51afef;">raise</span> <span style="color: #ECBE7B;">ValueError</span>(<span style="color: #98be65;">"Not running in GitHub Actions environment (GITHUB_REPOSITORY not found)"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Initialize GitHub client</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">github</span> = Github(<span style="color: #51afef;">self</span>.github_token)
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">repo</span> = <span style="color: #51afef;">self</span>.github.get_repo(<span style="color: #51afef;">self</span>.github_repo)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Initialize Readwise API settings</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">base_url</span> = <span style="color: #98be65;">"https://readwise.io/api/v2"</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">headers</span> = {
            <span style="color: #98be65;">"Authorization"</span>: f<span style="color: #98be65;">"Token </span>{<span style="color: #51afef;">self</span>.readwise_token}<span style="color: #98be65;">"</span>
        }
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">last_update_file</span> = <span style="color: #98be65;">"last_update.json"</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">articles_file</span> = <span style="color: #98be65;">"articles.json"</span>

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">get_highlights</span>(<span style="color: #51afef;">self</span>, updated_after: Optional[datetime] = <span style="color: #a9a1e1;">None</span>,
                      start_date: Optional[datetime] = <span style="color: #a9a1e1;">None</span>,
                      end_date: Optional[datetime] = <span style="color: #a9a1e1;">None</span>) -&gt; Dict:
        <span style="color: #83898d;">"""Get all highlights with their associated metadata"""</span>
        <span style="color: #dcaeea;">endpoint</span> = f<span style="color: #98be65;">"</span>{<span style="color: #51afef;">self</span>.base_url}<span style="color: #98be65;">/export/"</span>
        <span style="color: #dcaeea;">params</span> = {}

        <span style="color: #51afef;">if</span> updated_after:
            <span style="color: #dcaeea;">params</span>[<span style="color: #98be65;">"updated_after"</span>] = updated_after.isoformat()
        <span style="color: #51afef;">elif</span> start_date:
            <span style="color: #dcaeea;">params</span>[<span style="color: #98be65;">"updated_after"</span>] = start_date.isoformat()
            <span style="color: #51afef;">if</span> end_date:
                <span style="color: #dcaeea;">params</span>[<span style="color: #98be65;">"updated_before"</span>] = end_date.isoformat()

        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Fetching highlights with params: </span>{params}<span style="color: #98be65;">"</span>)
        <span style="color: #dcaeea;">response</span> = requests.get(endpoint, headers=<span style="color: #51afef;">self</span>.headers, params=params)
        response.raise_for_status()
        <span style="color: #51afef;">return</span> response.json()

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">get_file_content</span>(<span style="color: #51afef;">self</span>, path: <span style="color: #c678dd;">str</span>) -&gt; Optional[<span style="color: #c678dd;">str</span>]:
        <span style="color: #83898d;">"""Get file content from GitHub repository"""</span>
        <span style="color: #51afef;">try</span>:
            <span style="color: #dcaeea;">content</span> = <span style="color: #51afef;">self</span>.repo.get_contents(path)
            <span style="color: #51afef;">return</span> content.decoded_content.decode(<span style="color: #98be65;">'utf-8'</span>)
        <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
            <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"File </span>{path}<span style="color: #98be65;"> not found in repository: </span>{e}<span style="color: #98be65;">"</span>)
            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">None</span>

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">update_file</span>(<span style="color: #51afef;">self</span>, path: <span style="color: #c678dd;">str</span>, content: <span style="color: #c678dd;">str</span>, message: <span style="color: #c678dd;">str</span>):
        <span style="color: #83898d;">"""Update or create file in GitHub repository"""</span>
        <span style="color: #51afef;">try</span>:
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Try to get existing file</span>
            <span style="color: #c678dd;">file</span> = <span style="color: #51afef;">self</span>.repo.get_contents(path)
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Update existing file</span>
            <span style="color: #51afef;">self</span>.repo.update_file(
                path=path,
                message=message,
                content=content,
                sha=<span style="color: #c678dd;">file</span>.sha
            )
        <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span>:
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Create new file if it doesn't exist</span>
            <span style="color: #51afef;">self</span>.repo.create_file(
                path=path,
                message=message,
                content=content
            )

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">clean_title</span>(<span style="color: #51afef;">self</span>, title: <span style="color: #c678dd;">str</span>) -&gt; <span style="color: #c678dd;">str</span>:
        <span style="color: #83898d;">"""Clean title by removing newlines and extra spaces"""</span>
        <span style="color: #dcaeea;">title</span> = re.sub(r<span style="color: #98be65;">'\s+'</span>, <span style="color: #98be65;">' '</span>, title.replace(<span style="color: #98be65;">'</span><span style="color: #a9a1e1;">\n</span><span style="color: #98be65;">'</span>, <span style="color: #98be65;">' '</span>))
        <span style="color: #51afef;">return</span> title.strip()

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">create_article_json</span>(<span style="color: #51afef;">self</span>, highlights_data: Dict) -&gt; List[Dict]:
        <span style="color: #83898d;">"""Create a list of articles with title and URL, only for category 'articles'"""</span>
        <span style="color: #dcaeea;">articles</span> = []

        <span style="color: #51afef;">for</span> article <span style="color: #51afef;">in</span> highlights_data.get(<span style="color: #98be65;">'results'</span>, []):
            <span style="color: #51afef;">if</span> article.get(<span style="color: #98be65;">'category'</span>, <span style="color: #98be65;">''</span>).lower() == <span style="color: #98be65;">'articles'</span>:
                <span style="color: #dcaeea;">title</span> = <span style="color: #51afef;">self</span>.clean_title(article.get(<span style="color: #98be65;">'title'</span>, <span style="color: #98be65;">'Untitled'</span>))
                <span style="color: #dcaeea;">url</span> = article.get(<span style="color: #98be65;">'source_url'</span>, <span style="color: #98be65;">''</span>)

                articles.append({
                    <span style="color: #98be65;">'title'</span>: title,
                    <span style="color: #98be65;">'url'</span>: url
                })

        <span style="color: #51afef;">return</span> articles

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">load_last_update_from_github</span>(<span style="color: #51afef;">self</span>) -&gt; Optional[datetime]:
        <span style="color: #83898d;">"""Load the last update date from GitHub"""</span>
        <span style="color: #dcaeea;">content</span> = <span style="color: #51afef;">self</span>.get_file_content(<span style="color: #51afef;">self</span>.last_update_file)
        <span style="color: #51afef;">if</span> content:
            <span style="color: #51afef;">try</span>:
                <span style="color: #dcaeea;">data</span> = json.loads(content)
                <span style="color: #51afef;">return</span> datetime.strptime(data[<span style="color: #98be65;">'last_update'</span>], <span style="color: #98be65;">'%Y-%m-%d'</span>)
            <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
                <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Error parsing last update file: </span>{e}<span style="color: #98be65;">"</span>)
                <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">None</span>
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">None</span>

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">save_last_update_to_github</span>(<span style="color: #51afef;">self</span>):
        <span style="color: #83898d;">"""Save current date as last update date to GitHub"""</span>
        <span style="color: #dcaeea;">current_date</span> = datetime.now().strftime(<span style="color: #98be65;">'%Y-%m-%d'</span>)
        <span style="color: #dcaeea;">content</span> = json.dumps({<span style="color: #98be65;">'last_update'</span>: current_date})
        <span style="color: #51afef;">self</span>.update_file(
            path=<span style="color: #51afef;">self</span>.last_update_file,
            content=content,
            message=<span style="color: #98be65;">"Update last sync date"</span>
        )

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">load_existing_articles_from_github</span>(<span style="color: #51afef;">self</span>) -&gt; List[Dict]:
        <span style="color: #83898d;">"""Load existing articles from GitHub"""</span>
        <span style="color: #dcaeea;">content</span> = <span style="color: #51afef;">self</span>.get_file_content(<span style="color: #51afef;">self</span>.articles_file)
        <span style="color: #51afef;">if</span> content:
            <span style="color: #51afef;">try</span>:
                <span style="color: #51afef;">return</span> json.loads(content)
            <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
                <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Error parsing articles file: </span>{e}<span style="color: #98be65;">"</span>)
                <span style="color: #51afef;">return</span> []
        <span style="color: #51afef;">return</span> []

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">merge_articles</span>(<span style="color: #51afef;">self</span>, existing_articles: List[Dict], new_articles: List[Dict]) -&gt; List[Dict]:
        <span style="color: #83898d;">"""Merge new articles with existing ones, avoiding duplicates"""</span>
        <span style="color: #dcaeea;">existing_set</span> = {(article[<span style="color: #98be65;">'title'</span>], article[<span style="color: #98be65;">'url'</span>]) <span style="color: #51afef;">for</span> article <span style="color: #51afef;">in</span> existing_articles}

        <span style="color: #51afef;">for</span> article <span style="color: #51afef;">in</span> new_articles:
            <span style="color: #dcaeea;">article_tuple</span> = (article[<span style="color: #98be65;">'title'</span>], article[<span style="color: #98be65;">'url'</span>])
            <span style="color: #51afef;">if</span> article_tuple <span style="color: #51afef;">not</span> <span style="color: #51afef;">in</span> existing_set:
                existing_articles.append(article)
                existing_set.add(article_tuple)

        <span style="color: #51afef;">return</span> existing_articles

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">export_articles</span>(<span style="color: #51afef;">self</span>, start_date: Optional[<span style="color: #c678dd;">str</span>] = <span style="color: #a9a1e1;">None</span>,
                       end_date: Optional[<span style="color: #c678dd;">str</span>] = <span style="color: #a9a1e1;">None</span>,
                       all_time: <span style="color: #c678dd;">bool</span> = <span style="color: #a9a1e1;">False</span>):
        <span style="color: #83898d;">"""</span>
<span style="color: #83898d;">        Export articles to GitHub with smart update capability</span>

<span style="color: #83898d;">        Args:</span>
<span style="color: #83898d;">            start_date: Optional start date in YYYY-MM-DD format</span>
<span style="color: #83898d;">            end_date: Optional end date in YYYY-MM-DD format</span>
<span style="color: #83898d;">            all_time: If True, fetch all highlights regardless of dates</span>
<span style="color: #83898d;">        """</span>
        <span style="color: #51afef;">if</span> all_time:
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#24403;&#36873;&#25321; all_time &#26102;&#65292;&#24378;&#21046;&#33719;&#21462;&#25152;&#26377; highlights&#65292;&#24573;&#30053;&#19978;&#27425;&#26356;&#26032;&#26102;&#38388;</span>
            <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Fetching all highlights from the beginning"</span>)
            <span style="color: #dcaeea;">highlights_data</span> = <span style="color: #51afef;">self</span>.get_highlights()
        <span style="color: #51afef;">elif</span> start_date:
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#22914;&#26524;&#25351;&#23450;&#20102;&#24320;&#22987;&#26085;&#26399;&#65292;&#20351;&#29992;&#25351;&#23450;&#30340;&#26085;&#26399;&#33539;&#22260;</span>
            <span style="color: #dcaeea;">start_datetime</span> = datetime.strptime(start_date, <span style="color: #98be65;">'%Y-%m-%d'</span>)
            <span style="color: #dcaeea;">end_datetime</span> = datetime.strptime(end_date, <span style="color: #98be65;">'%Y-%m-%d'</span>) <span style="color: #51afef;">if</span> end_date <span style="color: #51afef;">else</span> datetime.now()
            <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Fetching highlights from </span>{start_date}<span style="color: #98be65;"> to </span>{end_date <span style="color: #51afef;">or</span> 'now'}<span style="color: #98be65;">"</span>)
            <span style="color: #dcaeea;">highlights_data</span> = <span style="color: #51afef;">self</span>.get_highlights(start_date=start_datetime, end_date=end_datetime)
        <span style="color: #51afef;">else</span>:
            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#20351;&#29992;&#19978;&#27425;&#26356;&#26032;&#26102;&#38388;&#30340;&#22686;&#37327;&#26356;&#26032;&#36923;&#36753;</span>
            <span style="color: #dcaeea;">last_update</span> = <span style="color: #51afef;">self</span>.load_last_update_from_github()
            <span style="color: #51afef;">if</span> last_update:
                <span style="color: #dcaeea;">days_since_update</span> = (datetime.now() - last_update).days
                <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Last update was </span>{days_since_update}<span style="color: #98be65;"> days ago on </span>{last_update.strftime('%Y-%m-%d')}<span style="color: #98be65;">"</span>)
                <span style="color: #51afef;">if</span> days_since_update &gt; <span style="color: #da8548; font-weight: bold;">0</span>:
                    <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Fetching highlights updated after </span>{last_update.strftime('%Y-%m-%d')}<span style="color: #98be65;">"</span>)
                    <span style="color: #dcaeea;">highlights_data</span> = <span style="color: #51afef;">self</span>.get_highlights(updated_after=last_update)
                <span style="color: #51afef;">else</span>:
                    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Already updated today, no need to fetch new articles"</span>)
                    <span style="color: #51afef;">return</span>
            <span style="color: #51afef;">else</span>:
                <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"No previous update found, fetching all articles"</span>)
                <span style="color: #dcaeea;">highlights_data</span> = <span style="color: #51afef;">self</span>.get_highlights()

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Create article data</span>
        <span style="color: #dcaeea;">new_articles</span> = <span style="color: #51afef;">self</span>.create_article_json(highlights_data)
        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Found </span>{<span style="color: #c678dd;">len</span>(new_articles)}<span style="color: #98be65;"> new articles"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Load existing articles</span>
        <span style="color: #dcaeea;">existing_articles</span> = <span style="color: #51afef;">self</span>.load_existing_articles_from_github()
        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Found </span>{<span style="color: #c678dd;">len</span>(existing_articles)}<span style="color: #98be65;"> existing articles"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Merge new articles with existing ones</span>
        <span style="color: #dcaeea;">merged_articles</span> = <span style="color: #51afef;">self</span>.merge_articles(existing_articles, new_articles)
        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Total unique articles after merge: </span>{<span style="color: #c678dd;">len</span>(merged_articles)}<span style="color: #98be65;">"</span>)

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Save merged articles to GitHub</span>
        <span style="color: #51afef;">self</span>.update_file(
            path=<span style="color: #51afef;">self</span>.articles_file,
            content=json.dumps(merged_articles, ensure_ascii=<span style="color: #a9a1e1;">False</span>, indent=<span style="color: #da8548; font-weight: bold;">2</span>),
            message=<span style="color: #98be65;">"Update articles list"</span>
        )

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Update the last update date</span>
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">not</span> start_date <span style="color: #51afef;">and</span> <span style="color: #51afef;">not</span> all_time:  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#21482;&#26377;&#22312;&#38750;&#25351;&#23450;&#26085;&#26399;&#33539;&#22260;&#21644;&#38750;&#20840;&#37327;&#26356;&#26032;&#30340;&#24773;&#20917;&#19979;&#25165;&#26356;&#26032;&#26368;&#21518;&#21516;&#27493;&#26102;&#38388;</span>
            <span style="color: #51afef;">self</span>.save_last_update_to_github()

        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"Successfully updated articles in GitHub repository"</span>)
        <span style="color: #51afef;">if</span> new_articles:
            <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"New articles added:"</span>)
            <span style="color: #51afef;">for</span> article <span style="color: #51afef;">in</span> new_articles:
                <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"- </span>{article['title']}<span style="color: #98be65;">"</span>)

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">main</span>():
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#20174;&#29615;&#22659;&#21464;&#37327;&#33719;&#21462; GitHub Actions &#30340;&#36755;&#20837;&#21442;&#25968;</span>
    <span style="color: #dcaeea;">gh_start_date</span> = os.environ.get(<span style="color: #98be65;">'INPUT_START_DATE'</span>, <span style="color: #98be65;">''</span>)
    <span style="color: #dcaeea;">gh_end_date</span> = os.environ.get(<span style="color: #98be65;">'INPUT_END_DATE'</span>, <span style="color: #98be65;">''</span>)
    <span style="color: #dcaeea;">gh_all_time</span> = os.environ.get(<span style="color: #98be65;">'INPUT_ALL_TIME'</span>, <span style="color: #98be65;">''</span>).lower() == <span style="color: #98be65;">'true'</span>

    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#35774;&#32622;&#21629;&#20196;&#34892;&#21442;&#25968;&#35299;&#26512;&#22120;</span>
    <span style="color: #dcaeea;">parser</span> = argparse.ArgumentParser(description=<span style="color: #98be65;">'Sync Readwise highlights to GitHub'</span>)
    parser.add_argument(<span style="color: #98be65;">'--start-date'</span>, <span style="color: #c678dd;">type</span>=<span style="color: #c678dd;">str</span>, <span style="color: #c678dd;">help</span>=<span style="color: #98be65;">'Start date in YYYY-MM-DD format'</span>)
    parser.add_argument(<span style="color: #98be65;">'--end-date'</span>, <span style="color: #c678dd;">type</span>=<span style="color: #c678dd;">str</span>, <span style="color: #c678dd;">help</span>=<span style="color: #98be65;">'End date in YYYY-MM-DD format'</span>)
    parser.add_argument(<span style="color: #98be65;">'--all-time'</span>, action=<span style="color: #98be65;">'store_true'</span>, <span style="color: #c678dd;">help</span>=<span style="color: #98be65;">'Fetch all highlights from the beginning'</span>)

    <span style="color: #dcaeea;">args</span> = parser.parse_args()

    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#20248;&#20808;&#20351;&#29992;&#21629;&#20196;&#34892;&#21442;&#25968;&#65292;&#22914;&#26524;&#27809;&#26377;&#21017;&#20351;&#29992; GitHub Actions &#30340;&#36755;&#20837;&#21442;&#25968;</span>
    <span style="color: #dcaeea;">start_date</span> = args.start_date <span style="color: #51afef;">or</span> gh_start_date
    <span style="color: #dcaeea;">end_date</span> = args.end_date <span style="color: #51afef;">or</span> gh_end_date
    <span style="color: #dcaeea;">all_time</span> = args.all_time <span style="color: #51afef;">or</span> gh_all_time

    <span style="color: #51afef;">try</span>:
        <span style="color: #dcaeea;">client</span> = ReadwiseAPI()
        client.export_articles(
            start_date=start_date <span style="color: #51afef;">if</span> start_date <span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">None</span>,
            end_date=end_date <span style="color: #51afef;">if</span> end_date <span style="color: #51afef;">else</span> <span style="color: #a9a1e1;">None</span>,
            all_time=all_time
        )
    <span style="color: #51afef;">except</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #51afef;">as</span> e:
        <span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"An error occurred: </span>{<span style="color: #c678dd;">str</span>(e)}<span style="color: #98be65;">"</span>)
        <span style="color: #51afef;">raise</span>

<span style="color: #51afef;">if</span> <span style="color: #c678dd;">__name__</span> == <span style="color: #98be65;">"__main__"</span>:
    main()

</pre>
</div>
</div>
</div>
